tf-controller plan output:

context:
- **namespace:** flux-system
- **name:** jowe-tf-controller-test
- **approvePlan:** auto
- **path:** ./
- **workspace:** default

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.changeme_local_file_hello will be created
  + resource "local_file" "changeme_local_file_hello" {
      + content              = "Hello terraform local!"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./changeme_local_file_hello_default.txt456"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

To apply this plan, please **merge** this pull request.
